# Використовуючи input() ввести речення, що складається з двох слів. Створити 2 змінні та в кожну записати по 1 введеному слову, використовуючи методи строк. Створити нову змінну трьома різними способами форматування (фактично 3 змінні), які складаються з введених слів у зворотному порядку, перше слово має складатися лише з великих літер, а друге з першої великої літери та інших дрібних. На початку речення повинен бути знак оклику, а в кінці запитальний.
# Використовуючи лише атрибути функції print(), вивести початковий рядок і отримані різними способами форматування через роздільник "<<<>>>".
# *Додаткове не обов'язкове завдання: вивід зробити у файл.
# Приклад виконання програми:
# введене речення: "кішка охайна"
# значення першої змінної: "кішка"
# значення другої змінної: "охайна"
# нова змінна: "!ОХАЙНА Кішка?"
# Цю змінну треба створити 3-ма різними способами форматування строк (%-форматування, метод .format та f-string). Буде 3 нові змінні з однаковими значеннями.
# Вивод функції print() повинен бути наступним:
# кішка охайна<<<>>>!ОХАЙНА Кішка?<<<>>>!ОХАЙНА Кішка?<<<>>>!ОХАЙНА Кішка?

variable_01, variable_02 = input("Прошу ввести речення з 2 слів: ").split()
print(variable_01+" "+variable_02, end="<<<>>>")
variable_01 = variable_01.capitalize()
variable_02 = variable_02.upper()

sentence_01 = "!%s %s?"
print(sentence_01 % (variable_02, variable_01), end="<<<>>>")
sentence_02 = "!{variable_02} {variable_01}?".format(variable_02=variable_02, variable_01=variable_01)
print(sentence_02, end="<<<>>>")
sentence_03 = f"!{variable_02} {variable_01}?"
print(sentence_03)
