# Написати програму яка отримає ім'я та вік користувача, перевіряє вік та видає вітальне повідомлення залежно від віку:
# - нуль чи не число: “Помилка, повторіть введення”;
# - більше нуля до 10 не включаючи: “Привіт, шкет «Ім'я»”;
# - від 10 до 18 включаючи: "Як справи, «Ім'я»?"
# - більше 18 і менше 100: "Що бажаєте «Ім'я»?
# - інакше: "«Ім'я», ви брешете - у наш час стільки не живуть..."
# *Додаткове не обов'язкове завдання:
# Програму необхідно загорнути у вічний цикл.
# Після чергового відпрацювання коду запитувати у користувача "Бажаєте вийти? (Д/Y)". Якщо відповідь буде буква "Д" або буква "Y" у будь-якому регістрі, то зробити вихід із вічного циклу. В іншому випадку продовжити виконання програми знову.

name = input("Добрий день! Назвіться: ")
age = input("Скільки Вам років? : ")

if age.isdigit() <= 0 or not int(age):
    print("Помилка, повторіть введення.")
elif int(age) < 10:
    print("Привіт, шкет " + name)
elif int(age) <= 18:
    print("Як справи " + name+"?")
elif int(age) < 100:
    print("Що бажаєте " + name+"?")
else:
    print(name+" ви брешете, у наш час стільки не живуть...")

answear = input("Бажаєте вийти? (Д/У): ").upper()
while answear == "Д":
    name = input("Добрий день! Назвіться: ")
    age = input("Скільки Вам років? : ")

    if age.isdigit() <= 0 or not int(age):
        print("Помилка, повторіть введення.")
    elif int(age) < 10:
        print("Привіт, шкет " + name)
    elif int(age) <= 18:
        print("Як справи " + name + "?")
    elif int(age) < 100:
        print("Що бажаєте " + name + "?")
    else:
        print(name + " ви брешете, у наш час стільки не живуть...")

    answear = input("Бажаєте вийти? (Д/У): ").upper()
