# Даний рядок у байтовому вигляді: b'r\xc3\xa9sum\xc3\xa9' закодована в кодуванні за умовчанням utf-8.
#
# Декодувати її у рядковий вигляд у кодуванні за замовчуванням.
#
# Потім результат знову перетворити на байтовий, тільки вже в кодуванні 'Latin1'
#
# І на кінець результат знову декодувати у рядок
#
# (Результати всіх перетворень виводити на екран).

text_01 = b'r\xc3\xa9sum\xc3\xa9'
text_02 = text_01.decode()
print(text_02)
text_02 = text_02.encode('Latin1')
print(text_02)
print(text_02.decode('Latin1'))
