# Прочитати збережений json-файл з попереднього завдання та записати дані на диск у csv-файл, першим стовпцьом буде ID (6-ти значне число, котре у попередньому завданні було ключем) і додавши новий стовпець "телефон". Крім цього, необхідно для кожного запису додати значення нової комірки “телефон”.
#
# Значення має бути заповнене випадковими цифрами.
#
# Назви стовпців будуть наступні:
#
# ID, Ім'я, Вік, Телефон.
#
# При цьому значення для перших трьох комірок необхідно дістати з json-файлу для кожного запису, а значення нової комірки "Телефон" сформувати.
#
# *Додаткове завдання не обов'язкове до виконання.
#
# Формування значення комірки телефону має бути наступним:
#
# • не всі люди можуть мати номер телефону. Хто має номер телефону, а хто ні визначається автоматично випадковим чином. З ймовірністю 75% осіб має номер телефону, з ймовірністю 25% - ні;
#
# • є список можливих трьох перших цифр (операторів), Наприклад: ['095', '066', '098', '096', '050', '097']
#
# • при формуванні нового номера телефону перші 3 цифри вибираються випадковим чином зі списку можливих операторів, решта 7 цифр може бути будь-якими і формуються випадковим чином.
#
# Для виконання цього завдання необхідно розібратися з бібліотекою "random"

import csv
import json
import pandas as pd
import random

with open('dictionary_two.json', 'r', encoding='utf-8') as file:
    new_dictionary = json.load(file)
    dictionare_four = pd.DataFrame(new_dictionary)
    keys = ['ID', 'name', 'years', 'phone']
    # x for x in range(keys):
    dictionare_four.to_csv(r'C:\Users\Елизавета\PycharmProjects\Hillel2\Hillel\Lesson_11\dictionare_tree.csv', index= False)

data_phone = [random.randint(111111111, 999999999) for x in range(1, 6)]

with open('dictionare_tree.csv', 'a', encoding='utf-8') as file:
    file_writer_02 = csv.writer(file, delimiter=',')
    dictionare_six = file_writer_02.writerow(data_phone)
