# Ввести з клавіатури ціле додатне число n.
#
# Отримати суму кубів всіх натуральних чисел від 1 до n(включаючи n). Винятки становлять усі числа кратні числу 3.
#
# Наприклад, якщо введено число 4, то вам потрібно скласти куби чисел від 1 до 4, виключаючи 3. Тобто: 1 + 8 + 64 = 73
#
# Реалізувати у 2-х варіантах: використовуючи цикл while та цикл for

numeric = input("Прошу ввести ціле додатне число: ")
if not numeric.isdigit() or int(numeric) <= 0:
    print("Ви ввели не вірні дані!")
else:
    numeric_01 = 0
    for numeric_02 in range(1, int(numeric)+1):
        if numeric_02 % 3 != 0:
            numeric_02 = numeric_02 ** 3
            numeric_01 += numeric_02
    else:
        print(numeric_01)
