# Ввести з клавіатури ціле додатне число n.
#
# Отримати суму кубів всіх натуральних чисел від 1 до n(включаючи n). Винятки становлять усі числа кратні числу 3.
#
# Наприклад, якщо введено число 4, то вам потрібно скласти куби чисел від 1 до 4, виключаючи 3. Тобто: 1 + 8 + 64 = 73
#
# Реалізувати у 2-х варіантах: використовуючи цикл while та цикл for
numeric = input("Прошу ввести ціле додатне число: ")
index_01 = 1
numeric_01 = 1
numeric_02 = 0
while index_01 <= int(numeric):
    if int(index_01) % 3 != 0:
        numeric_01 = index_01**3
        numeric_02 += numeric_01
    index_01 += 1
else:
    print(numeric_02)
